In [ ]:
import pandas as pd
import datetime
import numpy as np
#import io
#from google.colab import files

In [2]:
#uploaded = files.upload()

NameError: name 'files' is not defined

In [ ]:
#uploads = files.upload()

Saving dogTravel.csv to dogTravel (1).csv

In [8]:
# datadogs = pd.read_csv(io.BytesIO(uploaded['dogs.csv']), index_col='id')
datadogs = pd.read_csv('dogs.csv', index_col='id')

In [9]:
#traveldogs = pd.read_csv(io.BytesIO(uploads['dogTravel.csv']), index_col = 'id')
traveldogs = pd.read_csv('dogTravel.csv', index_col='id')

#travelds = pd.read_csv(io.BytesIO(uploads['dogTravel.csv']), index_col = 'index')
travelds = pd.read_csv('dogTravel.csv', index_col='index')

In [10]:
datadogs.head(2)

,org_id,url,type.x,species,breed_primary,breed_secondary,breed_mixed,breed_unknown,color_primary,color_secondary,...,contact_city,contact_state,contact_zip,contact_country,stateQ,accessed,type.y,description,stay_duration,stay_cost
id,,,,,,,,,,,,,,,,,,,,,
46042150,NV163,https://www.petfinder.com/dog/harley-46042150/...,Dog,Dog,American Staffordshire Terrier,Mixed Breed,True,False,White / Cream,Yellow / Tan / Blond / Fawn,...,Las Vegas,NV,89147,US,89009,2019-09-20,Dog,Harley is not sure how he wound up at shelter ...,70,124.81
46042002,NV163,https://www.petfinder.com/dog/biggie-46042002/...,Dog,Dog,Pit Bull Terrier,Mixed Breed,True,False,Brown / Chocolate,White / Cream,...,Las Vegas,NV,89147,US,89009,2019-09-20,Dog,6 year old Biggie has lost his home and really...,49,122.07

In [11]:
datadogs.columns

Index(['org_id', 'url', 'type.x', 'species', 'breed_primary',
       'breed_secondary', 'breed_mixed', 'breed_unknown', 'color_primary',
       'color_secondary', 'color_tertiary', 'age', 'sex', 'size', 'coat',
       'fixed', 'house_trained', 'declawed', 'special_needs', 'shots_current',
       'env_children', 'env_dogs', 'env_cats', 'name', 'status', 'posted',
       'contact_city', 'contact_state', 'contact_zip', 'contact_country',
       'stateQ', 'accessed', 'type.y', 'description', 'stay_duration',
       'stay_cost'],
      dtype='object')

### **001/Extract all dogs with status that is not adoptable**

In [12]:
Notadoptable = datadogs[datadogs['status'] != 'adoptable']
Notadoptable['status']

id
41330726    2018-04-05T05:18:31+0000
38169117    2017-05-26T21:43:16+0000
45833989    2019-09-01T15:12:06+0000
45515547    2019-08-06T12:15:58+0000
45294115    2019-07-18T14:20:58+0000
45229004    2019-07-11T20:34:42+0000
45227052    2019-07-11T14:16:38+0000
45569380    2019-08-10T16:00:35+0000
44694387    2019-05-14T21:09:27+0000
36978896    2016-12-15T13:33:43+0000
33218331    2015-09-07T12:57:27+0000
42092005    2018-07-05T00:55:08+0000
39594038    2017-10-07T23:48:20+0000
45895274    2019-09-07T04:09:12+0000
45964719    2019-09-13T19:39:28+0000
44538917    2019-04-25T01:56:52+0000
41430442    2018-04-18T13:45:46+0000
45907639    2019-09-08T18:21:21+0000
45362806    2019-07-25T19:53:21+0000
32590894    2015-06-29T23:58:09+0000
31426754    2015-02-07T13:06:43+0000
46037827    2019-09-20T01:50:51+0000
44044071    2019-02-18T12:02:48+0000
27521132    2013-10-10T13:57:39+0000
38473806    2017-06-16T18:44:33+0000
34101432    2015-12-25T12:28:30+0000
45958435    2019-09-13T06:08:17+0000
45927580    2019-09-10T16:43:35+0000
45916348    2019-09-09T17:05:17+0000
45733027    2019-08-24T16:32:31+0000
45413997    2019-07-31T16:21:07+0000
45406516    2019-07-29T21:50:16+0000
45264615    2019-07-15T16:57:05+0000
Name: status, dtype: object

In [13]:
len(Notadoptable)

33

## **002/ For each (primary) breed, determine the number of dogs**

In [14]:
datadogs['breed_primary'].value_counts()

Pit Bull Terrier                7890
Labrador Retriever              7198
Chihuahua                       3766
Mixed Breed                     3242
Terrier                         2641
                                ...
Wirehaired Pointing Griffon        1
Boykin Spaniel                     1
Old English Sheepdog               1
Belgian Shepherd / Laekenois       1
Tosa Inu                           1
Name: breed_primary, Length: 216, dtype: int64

## **003/ For each (primary) breed, determine the ratio between the number of dogs of Mixed Breed and those not of Mixed Breed. Hint: look at the secondary_breed.**

In [15]:
datadogs['breed_secondary'].value_counts()

Mixed Breed                           4348
Labrador Retriever                    2194
Pit Bull Terrier                      1365
Terrier                               1195
Hound                                 1143
                                      ...
Irish Water Spaniel                      1
Nova Scotia Duck Tolling Retriever       1
Karelian Bear Dog                        1
Old English Sheepdog                     1
Greater Swiss Mountain Dog               1
Name: breed_secondary, Length: 190, dtype: int64

In [16]:
counts = datadogs['breed_secondary'].value_counts()
percent = counts/datadogs['breed_secondary'].count()*100
pd.concat([counts,percent], axis=1, keys=['count', 'percentage'])

                                    count  percentage
Mixed Breed                          4348   20.882763
Labrador Retriever                   2194   10.537438
Pit Bull Terrier                     1365    6.555881
Terrier                              1195    5.739398
Hound                                1143    5.489650
...                                   ...         ...
Irish Water Spaniel                     1    0.004803
Nova Scotia Duck Tolling Retriever      1    0.004803
Karelian Bear Dog                       1    0.004803
Old English Sheepdog                    1    0.004803
Greater Swiss Mountain Dog              1    0.004803

[190 rows x 2 columns]

In [17]:
datadogs['breed_secondary'].describe()

count           20821
unique            190
top       Mixed Breed
freq             4348
Name: breed_secondary, dtype: object


## **004/ For each (primary) breed, determine the earliest and the latest posted timestamp.**

In [18]:
df = datadogs[['breed_primary','posted']]
df

                           breed_primary                    posted
id
46042150  American Staffordshire Terrier  2019-09-20T16:37:59+0000
46042002                Pit Bull Terrier  2019-09-20T16:24:57+0000
46040898                        Shepherd  2019-09-20T14:10:11+0000
46039877             German Shepherd Dog  2019-09-20T10:08:22+0000
46039306                       Dachshund  2019-09-20T06:48:30+0000
...                                  ...                       ...
44605893                   Border Collie  2019-05-03T14:23:49+0000
44457061             Australian Shepherd  2019-04-13T16:20:24+0000
42865848                   Border Collie  2018-09-27T04:18:56+0000
42734734                           Boxer  2018-09-12T05:03:38+0000
42663515              Labrador Retriever  2018-09-03T20:42:24+0000

[58180 rows x 2 columns]

In [19]:
len(df)

58180

In [20]:
lis_dig=[]
lis_str=[]
for ele in df.posted:
  if len(ele)>20:
    lis_dig.append(ele)
  else:
    lis_str.append(ele)

In [21]:
len(lis_dig)+len(lis_str)

58180

In [22]:
max(lis_dig)

'2019-09-20T17:32:30+0000'

In [23]:
min(lis_dig)

'2003-05-18T00:00:00+0000'


## **005/ For each state, compute the sex imbalance, that is the difference between male and female dogs. In which state this imbalance is largest?**

In [24]:
datadogs.columns

Index(['org_id', 'url', 'type.x', 'species', 'breed_primary',
       'breed_secondary', 'breed_mixed', 'breed_unknown', 'color_primary',
       'color_secondary', 'color_tertiary', 'age', 'sex', 'size', 'coat',
       'fixed', 'house_trained', 'declawed', 'special_needs', 'shots_current',
       'env_children', 'env_dogs', 'env_cats', 'name', 'status', 'posted',
       'contact_city', 'contact_state', 'contact_zip', 'contact_country',
       'stateQ', 'accessed', 'type.y', 'description', 'stay_duration',
       'stay_cost'],
      dtype='object')

In [25]:
datadogs.head(3)

,org_id,url,type.x,species,breed_primary,breed_secondary,breed_mixed,breed_unknown,color_primary,color_secondary,...,contact_city,contact_state,contact_zip,contact_country,stateQ,accessed,type.y,description,stay_duration,stay_cost
id,,,,,,,,,,,,,,,,,,,,,
46042150,NV163,https://www.petfinder.com/dog/harley-46042150/...,Dog,Dog,American Staffordshire Terrier,Mixed Breed,True,False,White / Cream,Yellow / Tan / Blond / Fawn,...,Las Vegas,NV,89147,US,89009,2019-09-20,Dog,Harley is not sure how he wound up at shelter ...,70,124.81
46042002,NV163,https://www.petfinder.com/dog/biggie-46042002/...,Dog,Dog,Pit Bull Terrier,Mixed Breed,True,False,Brown / Chocolate,White / Cream,...,Las Vegas,NV,89147,US,89009,2019-09-20,Dog,6 year old Biggie has lost his home and really...,49,122.07
46040898,NV99,https://www.petfinder.com/dog/ziggy-46040898/n...,Dog,Dog,Shepherd,NaN,False,False,Brindle,NaN,...,Mesquite,NV,89027,US,89009,2019-09-20,Dog,Approx 2 years old.\n Did I catch your eye? I ...,87,281.51

In [26]:
df = datadogs[['stateQ','contact_city', 'sex']]

In [27]:
df.head()

         stateQ contact_city     sex
id
46042150  89009    Las Vegas    Male
46042002  89009    Las Vegas    Male
46040898  89009     Mesquite    Male
46039877  89009      Pahrump  Female
46039306  89009    Henderson    Male

In [28]:
d = df.groupby(['stateQ','contact_city']).sex.value_counts()
d.tail()

stateQ  contact_city  sex
WY      Lander        Female     8
        Riverton      Male      14
                      Female     6
        Worland       Male       6
                      Female     5
Name: sex, dtype: int64

In [29]:
gender_state = df.groupby(['stateQ', 'sex']).agg({'sex': 'count'})
gender_state

                   sex
stateQ     sex
2019-09-20 Female   16
           Male     17
89009      Female  347
           Male    399
89014      Male      1
...                ...
WI         Male    279
WV         Female  281
           Male    396
WY         Female   21
           Male     31

[123 rows x 1 columns]

In [30]:
state_count = df.groupby(['stateQ']).agg('count')
state_count

            contact_city   sex
stateQ
2019-09-20            33    33
89009                746   746
89014                  1     1
89024                284   284
89027                  2     2
...                  ...   ...
VT                   118   118
WA                  1277  1277
WI                   543   543
WV                   677   677
WY                    52    52

[62 rows x 2 columns]

In [31]:
stateQ_gender = gender_state.div(state_count, level = "stateQ") * 100
stateQ_gender.loc[: , 'sex']

stateQ      sex
2019-09-20  Female     48.484848
            Male       51.515152
89009       Female     46.514745
            Male       53.485255
89014       Male      100.000000
                         ...
WI          Male       51.381215
WV          Female     41.506647
            Male       58.493353
WY          Female     40.384615
            Male       59.615385
Name: sex, Length: 123, dtype: float64

## **006/ For each pair (age, size), determine the average duration of the stay and the average cost of stay.**

In [32]:
datadogs.columns

Index(['org_id', 'url', 'type.x', 'species', 'breed_primary',
       'breed_secondary', 'breed_mixed', 'breed_unknown', 'color_primary',
       'color_secondary', 'color_tertiary', 'age', 'sex', 'size', 'coat',
       'fixed', 'house_trained', 'declawed', 'special_needs', 'shots_current',
       'env_children', 'env_dogs', 'env_cats', 'name', 'status', 'posted',
       'contact_city', 'contact_state', 'contact_zip', 'contact_country',
       'stateQ', 'accessed', 'type.y', 'description', 'stay_duration',
       'stay_cost'],
      dtype='object')

In [33]:
ds = datadogs[['age', 'size','stay_duration',
       'stay_cost']]
ds.head(3)

             age    size  stay_duration  stay_cost
id
46042150  Senior  Medium             70     124.81
46042002   Adult   Large             49     122.07
46040898   Adult   Large             87     281.51

In [34]:

ds.groupby(['age','size'])['stay_duration', 'stay_cost'].aggregate(['mean'])

/tmp/ipykernel_14426/2518439688.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  ds.groupby(['age','size'])['stay_duration', 'stay_cost'].aggregate(['mean'])

                   stay_duration   stay_cost
                            mean        mean
age    size
Adult  Extra Large     89.015414  232.591561
       Large           89.531943  238.661141
       Medium          89.421036  238.258977
       Small           89.407479  238.974838
Baby   Extra Large     87.032967  237.180879
       Large           89.701564  238.698827
       Medium          89.577668  237.108131
       Small           89.958291  239.083810
Senior Extra Large     88.861111  235.232361
       Large           88.984298  237.507364
       Medium          89.810052  238.514615
       Small           89.073626  238.282286
Young  Extra Large     90.586345  245.835582
       Large           90.104206  238.149506
       Medium          89.515123  239.304603
       Small           89.814275  241.540069

## **007/ Find the dogs involved in at least 3 travels. Also list the breed of those dogs.**

In [35]:
traveldogs.head(10)

,index,contact_city,contact_state,description,found,manual,remove,still_there
id,,,,,,,,
44520267,0,Anoka,MN,Boris is a handsome mini schnauzer who made hi...,Arkansas,NaN,NaN,NaN
44698509,1,Groveland,FL,Duke is an almost 2 year old Potcake from Abac...,Abacos,Bahamas,NaN,NaN
45983838,2,Adamstown,MD,Zac Woof-ron is a heartthrob movie star lookin...,Adam,Maryland,NaN,NaN
44475904,3,Saint Cloud,MN,~~Came in to the shelter as a transfer from an...,Adaptil,NaN,True,NaN
43877389,4,Pueblo,CO,Palang is such a sweetheart. She loves her peo...,Afghanistan,NaN,NaN,NaN
43082511,5,Manchester,CT,Brooke has an unusual past. She was rescued f...,Afghanistan,NaN,NaN,NaN
45287347,6,Wooster,OH,"Tate is an adorable 2 year old, 22 pound Cocka...",Akron,Ohio,NaN,NaN
45287347,7,Wooster,OH,"Tate is an adorable 2 year old, 22 pound Cocka...",Akron,Ohio,NaN,NaN
45987719,8,Locust Fork,AL,Meet Trixie... she is a female 2yr. Old Chihua...,Alabama,NaN,NaN,NaN
45943086,9,Locust Fork,AL,"Meet Reba, a 2-year-old Dachshund with a sleek...",Alabama,NaN,NaN,NaN

In [36]:
dt = travelds[['id','found']]

In [37]:
dt.shape

(6194, 2)

In [38]:
df.shape

(58180, 3)

In [39]:
id_count = dt.groupby(['id'])['id'].aggregate(['count'])
id_count

          count
id
8619716       2
9317153       1
12134429      1
14355301      1
16313278      1
...         ...
46042569      3
46042587      3
46042618      3
46043099      3
46043149      3

[4115 rows x 1 columns]

In [40]:
filt_id_count = id_count[id_count['count'] > 2]
len(filt_id_count)

563

In [41]:
s = df.merge(filt_id_count,how='inner', left_on='id', right_on='id')
s

         stateQ  contact_city     sex  count
id
45642530  89406  Gardnerville    Male      4
46039420     CO     Lafayette    Male      4
40036107     CO     Englewood  Female      3
45851842     CT        Carmel  Female      3
45841145     CT         Keene    Male      3
...         ...           ...     ...    ...
41144335     WA     Shoreline    Male      3
40103682     WA     Arlington  Female      3
38664932     WA     Shoreline  Female      3
38495992     WA     Shoreline  Female      3
45588395     WI     Green Bay    Male      3

[563 rows x 4 columns]

In [42]:
len(s)

563

## **008/ Fix the travels table so that the correct state is computed from the manual and the found fields. If manual is not missing, then it overrides what is stored in found.**

In [43]:
traveldogs.head(3)

,index,contact_city,contact_state,description,found,manual,remove,still_there
id,,,,,,,,
44520267,0,Anoka,MN,Boris is a handsome mini schnauzer who made hi...,Arkansas,NaN,NaN,NaN
44698509,1,Groveland,FL,Duke is an almost 2 year old Potcake from Abac...,Abacos,Bahamas,NaN,NaN
45983838,2,Adamstown,MD,Zac Woof-ron is a heartthrob movie star lookin...,Adam,Maryland,NaN,NaN

In [44]:
traveldogs.manual.isna().sum()

4047

In [45]:
traveldogs.manual.notnull().sum()

2147

In [46]:
traveldogs.manual.isna().sum()+traveldogs.manual.notnull().sum()

6194

In [47]:
traveldogs.shape

(6194, 8)

In [48]:
trv = traveldogs[['found','manual']]
trv

                found    manual
id
44520267     Arkansas       NaN
44698509       Abacos   Bahamas
45983838         Adam  Maryland
44475904      Adaptil       NaN
43877389  Afghanistan       NaN
...               ...       ...
40492179           WV       NaN
45799729      Wyoming       NaN
34276515       Yazmin       NaN
44519341        Young      Ohio
36659999         Zazu       NaN

[6194 rows x 2 columns]

In [49]:
trv['manual'].fillna(0, inplace=True)

/tmp/ipykernel_14426/2826279541.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  trv['manual'].fillna(0, inplace=True)

In [51]:
trv.manual

id
44520267           0
44698509     Bahamas
45983838    Maryland
44475904           0
43877389           0
              ...
40492179           0
45799729           0
34276515           0
44519341        Ohio
36659999           0
Name: manual, Length: 6194, dtype: object

In [54]:
for row in trv.itertuples():
    if row.manual != 0 :
        trv.at[row.Index,'found'] = row.manual
    else:
        pass

/tmp/ipykernel_14426/603070336.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  trv.at[row.Index,'found'] = row.manual

In [55]:
trv

                  found    manual
id
44520267       Arkansas         0
44698509        Bahamas   Bahamas
45983838       Maryland  Maryland
44475904        Adaptil         0
43877389    Afghanistan         0
...                 ...       ...
40492179  West Virginia         0
45799729        Wyoming         0
34276515         Yazmin         0
44519341           Ohio      Ohio
36659999           Zazu         0

[6194 rows x 2 columns]

## **009/ For each state, compute the ratio between the number of travels and the population.**

In [56]:
traveldogs.head(2)

,index,contact_city,contact_state,description,found,manual,remove,still_there
id,,,,,,,,
44520267,0,Anoka,MN,Boris is a handsome mini schnauzer who made hi...,Arkansas,NaN,NaN,NaN
44698509,1,Groveland,FL,Duke is an almost 2 year old Potcake from Abac...,Abacos,Bahamas,NaN,NaN

In [57]:
travelds.head(3)

,id,contact_city,contact_state,description,found,manual,remove,still_there
index,,,,,,,,
0,44520267,Anoka,MN,Boris is a handsome mini schnauzer who made hi...,Arkansas,NaN,NaN,NaN
1,44698509,Groveland,FL,Duke is an almost 2 year old Potcake from Abac...,Abacos,Bahamas,NaN,NaN
2,45983838,Adamstown,MD,Zac Woof-ron is a heartthrob movie star lookin...,Adam,Maryland,NaN,NaN

In [58]:
travelds.shape

(6194, 8)

In [59]:
travelds.isna().sum()

id                  0
contact_city        0
contact_state       0
description         0
found               0
manual           4047
remove           4456
still_there      5875
dtype: int64

In [60]:
dd = travelds['id']

In [61]:
type(travelds['id'][1])

numpy.int64

In [62]:
count = 0

for row in range(len(dd)):
  if type(row) == int:
       count+=1
print(count)

6194

In [63]:
id_count_ = travelds.groupby(['id'])['id'].aggregate(['count'])
id_count_

          count
id
8619716       2
9317153       1
12134429      1
14355301      1
16313278      1
...         ...
46042569      3
46042587      3
46042618      3
46043099      3
46043149      3

[4115 rows x 1 columns]

In [64]:
id_count = id_count_[id_count_['count'] == 1]
len(id_count)

2891

In [65]:
len(travelds)

6194

In [66]:
id_count = id_count_[id_count_['count'] == 2]
len(id_count)

661

In [67]:
id_count = id_count_[id_count_['count'] == 3]
len(id_count)

384

In [68]:
id_count = id_count_[id_count_['count'] == 4]
len(id_count)

92

In [69]:
id_count = id_count_[id_count_['count'] == 5]
len(id_count)

78

In [70]:
id_count = id_count_[id_count_['count'] == 6]
len(id_count)

0

In [71]:
id_count = id_count_[id_count_['count'] >6]
len(id_count)

9

In [72]:
id_count = id_count_[id_count_['count'] == 7]
len(id_count)

7

In [73]:
id_count = id_count_[id_count_['count'] == 11]
len(id_count)

2

In [74]:
id_count = id_count_[id_count_['count'] == 7]
len(id_count)

7

In [75]:
dm = travelds[['contact_state','id']]

009/ For each state, compute the ratio between the number of travels and the population.

In [76]:
id_count_ = dm.groupby(['contact_state','id'])['id'].aggregate(['count'])
id_count_

                        count
contact_state id
17325         33218331      5
              36978896      5
AL            43089521      1
              44429318      1
              44537647      1
...                       ...
WV            45188051      2
              45408933      2
              45524238      2
              45903674      2
              45919924      2

[4117 rows x 1 columns]

In [77]:
total_ = id_count_.sum()

In [78]:
stats_pop = id_count_.div(total_, level = "contact_state") * 100
stats_pop

                           count
contact_state id
17325         33218331  0.080723
              36978896  0.080723
AL            43089521  0.016145
              44429318  0.016145
              44537647  0.016145
...                          ...
WV            45188051  0.032289
              45408933  0.032289
              45524238  0.032289
              45903674  0.032289
              45919924  0.032289

[4117 rows x 1 columns]

In [79]:
stats_pop['count'].sum()

100.0

## **0010/ For each dog, compute the number of days from the posted day to the day of last access.**

In [80]:
datadogs.head(3)

,org_id,url,type.x,species,breed_primary,breed_secondary,breed_mixed,breed_unknown,color_primary,color_secondary,...,contact_city,contact_state,contact_zip,contact_country,stateQ,accessed,type.y,description,stay_duration,stay_cost
id,,,,,,,,,,,,,,,,,,,,,
46042150,NV163,https://www.petfinder.com/dog/harley-46042150/...,Dog,Dog,American Staffordshire Terrier,Mixed Breed,True,False,White / Cream,Yellow / Tan / Blond / Fawn,...,Las Vegas,NV,89147,US,89009,2019-09-20,Dog,Harley is not sure how he wound up at shelter ...,70,124.81
46042002,NV163,https://www.petfinder.com/dog/biggie-46042002/...,Dog,Dog,Pit Bull Terrier,Mixed Breed,True,False,Brown / Chocolate,White / Cream,...,Las Vegas,NV,89147,US,89009,2019-09-20,Dog,6 year old Biggie has lost his home and really...,49,122.07
46040898,NV99,https://www.petfinder.com/dog/ziggy-46040898/n...,Dog,Dog,Shepherd,NaN,False,False,Brindle,NaN,...,Mesquite,NV,89027,US,89009,2019-09-20,Dog,Approx 2 years old.\n Did I catch your eye? I ...,87,281.51

In [81]:
datadogs.columns

Index(['org_id', 'url', 'type.x', 'species', 'breed_primary',
       'breed_secondary', 'breed_mixed', 'breed_unknown', 'color_primary',
       'color_secondary', 'color_tertiary', 'age', 'sex', 'size', 'coat',
       'fixed', 'house_trained', 'declawed', 'special_needs', 'shots_current',
       'env_children', 'env_dogs', 'env_cats', 'name', 'status', 'posted',
       'contact_city', 'contact_state', 'contact_zip', 'contact_country',
       'stateQ', 'accessed', 'type.y', 'description', 'stay_duration',
       'stay_cost'],
      dtype='object')

In [82]:
len(datadogs.posted)

58180

In [83]:
lis_digt=[]
lis_strg=[]
for ele in datadogs.posted:
  if len(ele)>20:
    lis_digt.append(ele)
  else:
    lis_strg.append(ele)

In [84]:
len(lis_digt)

58147

In [85]:
len(lis_strg)

33

In [86]:
lis_strg

['Las Vegas',
 'Chandler',
 'Albany',
 'Albany',
 'Albany',
 'Saugerties',
 'Saugerties',
 'Bristow',
 'Silver Spring',
 'Gettysburg',
 'Gettysburg',
 'Media',
 'Feasterville',
 'Paris',
 'Mooresville',
 'Ross',
 'Ross',
 'Jeffersonville',
 'Cincinnati',
 'Paoli',
 'lake charles',
 'Albuquerque',
 'Cookeville',
 'Nashville',
 'Rustburg',
 'Midlothian',
 'Seattle',
 'Seattle',
 'Seattle',
 'Seattle',
 'Seattle',
 'Seattle',
 'Seattle']

In [87]:
i = 0
for ele in datadogs.posted.values:
     if len(ele) < 20:
          print(ele)
          i +=1
print(i)

Las Vegas
Chandler
Albany
Albany
Albany
Saugerties
Saugerties
Bristow
Silver Spring
Gettysburg
Gettysburg
Media
Feasterville
Paris
Mooresville
Ross
Ross
Jeffersonville
Cincinnati
Paoli
lake charles
Albuquerque
Cookeville
Nashville
Rustburg
Midlothian
Seattle
Seattle
Seattle
Seattle
Seattle
Seattle
Seattle
33

In [88]:
datadogs.shape

(58180, 36)

In [89]:
dog_fil_post = datadogs[datadogs['posted'].str.len() > 20]
dog_fil_post.shape

(58147, 36)

In [90]:
dog_fil_post.loc['posted'] = pd.to_datetime(dog_fil_post['posted']).dt.strftime('%Y-%m-%d')
dog_fil_post.posted

/tmp/ipykernel_14426/2678823910.py:1: FutureWarning: Behavior when concatenating bool-dtype and numeric-dtype arrays is deprecated; in a future version these will cast to object dtype (instead of coercing bools to numeric values). To retain the old behavior, explicitly cast bool-dtype arrays to numeric dtype.
  dog_fil_post.loc['posted'] = pd.to_datetime(dog_fil_post['posted']).dt.strftime('%Y-%m-%d')
/tmp/ipykernel_14426/2678823910.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  dog_fil_post.loc['posted'] = pd.to_datetime(dog_fil_post['posted']).dt.strftime('%Y-%m-%d')

id
46042150    2019-09-20T16:37:59+0000
46042002    2019-09-20T16:24:57+0000
46040898    2019-09-20T14:10:11+0000
46039877    2019-09-20T10:08:22+0000
46039306    2019-09-20T06:48:30+0000
                      ...
44457061    2019-04-13T16:20:24+0000
42865848    2018-09-27T04:18:56+0000
42734734    2018-09-12T05:03:38+0000
42663515    2018-09-03T20:42:24+0000
posted                           NaN
Name: posted, Length: 58148, dtype: object

In [95]:

dog_fil_post.loc['accessed'] = pd.to_datetime(dog_fil_post['accessed']).dt.strftime('%Y-%m-%d')
dog_fil_post['posted'] = pd.to_datetime(dog_fil_post['posted']).dt.strftime('%Y-%m-%d')
dog_fil_post[['posted','accessed']].head()

/tmp/ipykernel_14426/1667687567.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  dog_fil_post['posted'] = pd.to_datetime(dog_fil_post['posted']).dt.strftime('%Y-%m-%d')

              posted    accessed
id
46042150  2019-09-20  2019-09-20
46042002  2019-09-20  2019-09-20
46040898  2019-09-20  2019-09-20
46039877  2019-09-20  2019-09-20
46039306  2019-09-20  2019-09-20

In [96]:
dog_fil_post['nb_days'] = ((pd.to_datetime(dog_fil_post['posted'])-pd.to_datetime(dog_fil_post['accessed'])).dt.days).abs()
dog_fil_d = dog_fil_post[['accessed','posted','nb_days']].sort_values(by = 'nb_days', ascending= False )
dog_fil_d.head()

/tmp/ipykernel_14426/849914002.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  dog_fil_post['nb_days'] = ((pd.to_datetime(dog_fil_post['posted'])-pd.to_datetime(dog_fil_post['accessed'])).dt.days).abs()

           accessed      posted  nb_days
id
604115   2019-09-20  2003-05-18   5969.0
2592031  2019-09-20  2004-02-23   5688.0
2613506  2019-09-20  2004-02-29   5682.0
4527948  2019-09-20  2005-05-30   5226.0
5142790  2019-09-20  2005-09-26   5107.0

## **011/  Partition the dogs according to the number of weeks from the posted day to the day of last access.**

In [134]:
dog_fil_d['nb_weeks'] = dog_fil_post['nb_days']//7
dog_fil_d.head()

           accessed      posted  nb_days  nb_weeks
id
604115   2019-09-20  2003-05-18   5969.0     852.0
2592031  2019-09-20  2004-02-23   5688.0     812.0
2613506  2019-09-20  2004-02-29   5682.0     811.0
4527948  2019-09-20  2005-05-30   5226.0     746.0
5142790  2019-09-20  2005-09-26   5107.0     729.0

In [168]:
d = dog_fil_d.groupby(['nb_weeks','id']).value_counts().sort_values(ascending=False).head(22)
d

nb_weeks  id        accessed    posted      nb_days
0.0       39878821  2019-09-20  2019-09-16  4.0        1
13.0      44996447  2019-09-20  2019-06-16  96.0       1
          44991279  2019-09-20  2019-06-16  96.0       1
          44991288  2019-09-20  2019-06-16  96.0       1
          44991339  2019-09-20  2019-06-16  96.0       1
          44991347  2019-09-20  2019-06-16  96.0       1
          44991374  2019-09-20  2019-06-16  96.0       1
          44991517  2019-09-20  2019-06-16  96.0       1
          44991632  2019-09-20  2019-06-16  96.0       1
          44991877  2019-09-20  2019-06-16  96.0       1
          44992155  2019-09-20  2019-06-16  96.0       1
          44992220  2019-09-20  2019-06-16  96.0       1
          44992282  2019-09-20  2019-06-16  96.0       1
          44993552  2019-09-20  2019-06-16  96.0       1
          44993688  2019-09-20  2019-06-16  96.0       1
          44993690  2019-09-20  2019-06-16  96.0       1
          44993773  2019-09-20  2019-06-16  96.0       1
          44994123  2019-09-20  2019-06-16  96.0       1
          44994338  2019-09-20  2019-06-16  96.0       1
          44995020  2019-09-20  2019-06-16  96.0       1
          44995634  2019-09-20  2019-06-16  96.0       1
          44995635  2019-09-20  2019-06-16  96.0       1
dtype: int64